## Staging: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 3 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.wordpress_ecs_task_get_secret_value will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "wordpress_ecs_task_get_secret_value"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "secretsmanager:GetSecretValue",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
              + "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
              + (known after apply),
            ]
        }
    }

  # data.template_file.wordpress_container_definition will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "wordpress_container_definition"  {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            [
              {
                "portMappings": [
                  {
                    "hostPort": 443,
                    "containerPort": 443,
                    "protocol": "tcp"
                  }
                ],
                "logConfiguration": {
                  "logDriver": "awslogs",
                  "options": {
                    "awslogs-group": "${AWS_LOGS_GROUP}",
                    "awslogs-region": "${AWS_LOGS_REGION}",
                    "awslogs-stream-prefix": "${AWS_LOGS_STREAM_PREFIX}"
                  }
                },
                "volumesFrom": [],
                "essential": true,
                "name": "wordpress",
                "image": "${WORDPRESS_IMAGE}",
                "mountPoints": [
                  %{ if ENABLE_EFS }
                  {
                    "containerPath": "/var/www/html/wp-content",
                    "sourceVolume": "wp-content",
                    "readOnly": false
                  }
                  %{ endif }
                ],
                "environment": [
                  {
                    "name": "DEFAULT_DOMAIN",
                    "value": "${DEFAULT_DOMAIN}"
                  },
                  {
                    "name": "WORDPRESS_CONFIG_EXTRA",
                    "value": "${WORDPRESS_CONFIG_EXTRA}"
                  }
                ],
                "secrets": [
                  {
                    "name": "LIST_MANAGER_ENDPOINT",
                    "valueFrom": "${LIST_MANAGER_ENDPOINT}"
                  },
                  {
                    "name": "DEFAULT_LIST_MANAGER_API_KEY",
                    "valueFrom": "${DEFAULT_LIST_MANAGER_API_KEY}"
                  },
                  {
                    "name": "DEFAULT_NOTIFY_API_KEY",
                    "valueFrom": "${DEFAULT_NOTIFY_API_KEY}"
                  },
                  {
                    "name": "ENCRYPTION_KEY",
                    "valueFrom": "${ENCRYPTION_KEY}"
                  },
                  {
                    "name": "S3_UPLOADS_BUCKET",
                    "valueFrom": "${S3_UPLOADS_BUCKET}"
                  },
                  {
                    "name": "S3_UPLOADS_KEY",
                    "valueFrom": "${S3_UPLOADS_KEY}"
                  },
                  {
                    "name": "S3_UPLOADS_SECRET",
                    "valueFrom": "${S3_UPLOADS_SECRET}"
                  },
                  {
                    "name": "WORDPRESS_DB_HOST",
                    "valueFrom": "${WORDPRESS_DB_HOST}"
                  },
                  {
                    "name": "WORDPRESS_DB_USER",
                    "valueFrom": "${WORDPRESS_DB_USER}"
                  },
                  {
                    "name": "WORDPRESS_DB_PASSWORD",
                    "valueFrom": "${WORDPRESS_DB_PASSWORD}"
                  },
                  {
                    "name": "WORDPRESS_DB_NAME",
                    "valueFrom": "${WORDPRESS_DB_NAME}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_KEY",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_KEY}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_KEY",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_KEY}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_KEY",
                    "valueFrom": "${WORDPRESS_NONCE_KEY}"
                  },
                  {
                    "name": "WORDPRESS_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_SECURE_AUTH_SALT",
                    "valueFrom": "${WORDPRESS_SECURE_AUTH_SALT}"
                  },
                  {
                    "name": "WORDPRESS_LOGGED_IN_SALT",
                    "valueFrom": "${WORDPRESS_LOGGED_IN_SALT}"
                  },
                  {
                    "name": "WORDPRESS_NONCE_SALT",
                    "valueFrom": "${WORDPRESS_NONCE_SALT}"
                  }
                ]
              }
            ]
        EOT
      + vars     = {
          + "AWS_LOGS_GROUP"               = "/aws/ecs/wordpress"
          + "AWS_LOGS_REGION"              = "ca-central-1"
          + "AWS_LOGS_STREAM_PREFIX"       = "wordpress-task"
          + "DEFAULT_DOMAIN"               = "articles.cdssandbox.xyz"
          + "DEFAULT_LIST_MANAGER_API_KEY" = (known after apply)
          + "DEFAULT_NOTIFY_API_KEY"       = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:default_notify_api_key_9tv4ch-5Pxn8F"
          + "ENABLE_EFS"                   = "false"
          + "ENCRYPTION_KEY"               = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR"
          + "LIST_MANAGER_ENDPOINT"        = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr"
          + "S3_UPLOADS_BUCKET"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn"
          + "S3_UPLOADS_KEY"               = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn"
          + "S3_UPLOADS_SECRET"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn"
          + "WORDPRESS_AUTH_KEY"           = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9"
          + "WORDPRESS_AUTH_SALT"          = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4"
          + "WORDPRESS_CONFIG_EXTRA"       = "define('WP_HOME','https://articles.cdssandbox.xyz');define('WP_SITEURL','https://articles.cdssandbox.xyz');define('MYSQL_CLIENT_FLAGS', MYSQLI_CLIENT_SSL);"
          + "WORDPRESS_DB_HOST"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0"
          + "WORDPRESS_DB_NAME"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4"
          + "WORDPRESS_DB_PASSWORD"        = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572"
          + "WORDPRESS_DB_USER"            = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe"
          + "WORDPRESS_IMAGE"              = "729164266357.dkr.ecr.ca-central-1.amazonaws.com/platform/wordpress:v1.9.1"
          + "WORDPRESS_LOGGED_IN_KEY"      = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO"
          + "WORDPRESS_LOGGED_IN_SALT"     = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV"
          + "WORDPRESS_NONCE_KEY"          = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn"
          + "WORDPRESS_NONCE_SALT"         = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb"
          + "WORDPRESS_SECURE_AUTH_KEY"    = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85"
          + "WORDPRESS_SECURE_AUTH_SALT"   = "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB"
        }
    }

  # aws_ecs_service.wordpress_service will be updated in-place
  ~ resource "aws_ecs_service" "wordpress_service" {
        id                                 = "arn:aws:ecs:ca-central-1:729164266357:service/wordpress/wordpress"
        name                               = "wordpress"
        tags                               = {
            "CostCentre" = "PlatformGCArticles"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:729164266357:task-definition/wordpress:18" -> (known after apply)
        # (14 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.wordpress_task will be created
  + resource "aws_ecs_task_definition" "wordpress_task" {
      + arn                      = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + execution_role_arn       = "arn:aws:iam::729164266357:role/wordpress-ecs-task"
      + family                   = "wordpress"
      + id                       = (known after apply)
      + memory                   = "3072"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + tags_all                 = {
          + "CostCentre" = "PlatformGCArticles"
        }
      + task_role_arn            = "arn:aws:iam::729164266357:role/wordpress-ecs-task"
    }

  # aws_iam_policy.wordpress_ecs_task_get_secret_value will be updated in-place
  ~ resource "aws_iam_policy" "wordpress_ecs_task_get_secret_value" {
        id        = "arn:aws:iam::729164266357:policy/WordpressEcsTaskGetSecretValue"
        name      = "WordpressEcsTaskGetSecretValue"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_salt_9tv4ch-esn0hB",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_secure_auth_key_9tv4ch-c1FG85",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_salt_9tv4ch-rfqWnb",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_nonce_key_9tv4ch-rD16Mn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_salt_9tv4ch-fHVfaV",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_logged_in_key_9tv4ch-cu7bvO",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_username_j5ihus-33gyWe",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_password_j5ihus-DCw572",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_name_j5ihus-XAAsB4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_database_host_j5ihus-fwa2r0",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_salt_9tv4ch-7Z7et4",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:wordpress_auth_key_9tv4ch-Odjot9",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_secret_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_key_9tv4ch-05Y9tn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:s3_uploads_bucket_9tv4ch-s78sQn",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:list_manager_endpoint_9tv4ch-S5UpJr",
                          - "arn:aws:secretsmanager:ca-central-1:729164266357:secret:encryption_key_9tv4ch-6TpYFR",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.default_list_manager_api_key will be created
  + resource "aws_secretsmanager_secret" "default_list_manager_api_key" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = "default_list_manager_api_key_9tv4ch"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = (known after apply)

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # aws_secretsmanager_secret_version.default_list_manager_api_key will be created
  + resource "aws_secretsmanager_secret_version" "default_list_manager_api_key" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>